backend/soap-dist.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <nfeDistDFeInteresse xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeDistribuicaoDFe">
      <distDFeInt xmlns="http://www.portalfiscal.inf.br/nfe" versao="1.01">
        <tpAmb>1</tpAmb>
        <cUFAutor>35</cUFAutor>
        <CNPJ>52055075000173</CNPJ>
        <distNSU>
          <ultNSU>000000000000000</ultNSU>
        </distNSU>
      </distDFeInt>
    </nfeDistDFeInteresse>
  </soap:Body>
</soap:Envelope>
